<%@ Page Language="C#" MasterPageFile="~/Views/Shared/Site.Master" Inherits="System.Web.Mvc.ViewPage" %>

<asp:Content ID="aboutTitle" ContentPlaceHolderID="TitleContent" runat="server">
    О Проекте
</asp:Content>
<asp:Content ID="aboutContent" ContentPlaceHolderID="MainContent" runat="server">
    <h2>
        О Проекте</h2>
    <p>
        Проект tdd4.net посвящен разработке программного обеспечения с использованием платформы
        .Net. Основной упор будет делаться на разработку через тестирование (Test Drive
        Development). Но в круг интересов портала попадают не только тесты, но и смежные
        темы:</p>
    <ul>
        <li>технологии </li>
        <li>инструменты </li>
        <li>менеджмент </li>
        <li>книги </li>
        <li>личный опыт </li>
    </ul>
    <h3>
        Зачем это нужно</h3>
    <p>
        В настоящее время наблюдается весьма оживленный интерес к гибким методологиям и
        модульному тестированию в том числе. Практически на каждой IT конференции много
        рассказывается о TDD.
    </p>
    <p>
        Однако вместе с тем создается впечатление, что все то, о чем говорят на конференциях,
        на тех же конференциях и остается. Ну или добавляется в список "классная штука...
        жалко, что у нас нельзя ее использовать". Некоторые пытаются использовать, но то,
        что казалось таким простым на докладе, оказывается несколько сложнее на практике.
        В результате попытки часто заканчиваются неудачей -- а ведь <b> вы просто не умеете
        их готовить (с)</b>.
    </p>
    <p>
        Задача этого ресурса -- показать, насколько это просто, продуктивно и полезно. Но
        и кроме этого поделиться опытом разработки .Net приложений.
    </p>
    <h3>
        Что дальше?</h3>
    <p>
        Дальше будет еще больше интересных новостей, статей и обзоров. На сайт будут добавляться
        новые возможности, разделы и инструменты. Следите за обновлениями!</p>
</asp:Content>
